#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infrastructure relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/fridge-mate/fridge-mate/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/fridge-mate/fridge-mate

To view this run in a browser, visit:
https://app.terraform.io/app/teashaped/fridge-mate/runs/run-YZ9u5Lghj6RGiH6n

Waiting for the plan to start...

Terraform v1.2.3
on linux_amd64
Initializing plugins and modules...
data.archive_file.getproducts: Reading...
random_pet.lambda_bucket_name: Refreshing state... [id=lambda-artifacts-moccasin]
aws_acm_certificate.ssl_certificate: Refreshing state... [id=arn:aws:acm:us-east-1:619593055185:certificate/7611e89f-b718-40fe-a0de-4a59b521ef3e]
data.archive_file.getproducts: Read complete after 0s [id=bbfa1e362dedfd5c3113f627c7a6aff5339e8f5c]
aws_acm_certificate_validation.cert_validation: Refreshing state... [id=2022-06-22 13:17:44.926 +0000 UTC]
data.aws_iam_policy_document.website_policy: Reading...
aws_iam_role.lambda_exec: Refreshing state... [id=serverless_lambda]
aws_apigatewayv2_api.lambda: Refreshing state... [id=4iujmd0o21]
aws_s3_bucket.lambda_bucket: Refreshing state... [id=lambda-artifacts-moccasin]
data.aws_iam_policy_document.website_policy: Read complete after 0s [id=1496418631]
aws_cognito_user_pool.user_pool: Refreshing state... [id=eu-north-1_KHLJifQDi]
aws_s3_bucket.fridge_mate: Refreshing state... [id=fridge-mate]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=serverless_lambda-20220622131732445300000001]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/serverless_lambda_gw]
aws_apigatewayv2_stage.lambda: Refreshing state... [id=serverless_lambda_stage]
aws_s3_bucket_object.getproducts_object: Refreshing state... [id=getproducts.zip]
aws_lambda_function.getproducts_lambda: Refreshing state... [id=GetProducts]
aws_s3_bucket_website_configuration.fridge_mate: Refreshing state... [id=fridge-mate]
aws_s3_bucket_cors_configuration.cors_config: Refreshing state... [id=fridge-mate]
aws_s3_bucket_object.site-content["assets/images/fc-logo.png"]: Refreshing state... [id=assets/images/fc-logo.png]
aws_s3_bucket_object.site-content["index.html"]: Refreshing state... [id=index.html]
aws_s3_bucket_object.site-content["assets/products.json"]: Refreshing state... [id=assets/products.json]
aws_s3_bucket_object.site-content["list-products.js"]: Refreshing state... [id=list-products.js]
aws_cloudfront_distribution.fridge_mate_distribution: Refreshing state... [id=E2HHX4B0I6ZY5X]
aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_cloudwatch_log_group.getproducts_cw: Refreshing state... [id=/aws/lambda/GetProducts]
aws_apigatewayv2_integration.getproducts: Refreshing state... [id=dyr8dlm]
aws_apigatewayv2_route.getproducts: Refreshing state... [id=lx9il6o]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_authorizer.authorizer will be created
  + resource "aws_api_gateway_authorizer" "authorizer" {
      + authorizer_result_ttl_in_seconds = 300
      + id                               = (known after apply)
      + identity_source                  = "method.request.header.Authorization"
      + name                             = "user-authorizer"
      + provider_arns                    = [
          + "arn:aws:cognito-idp:eu-north-1:619593055185:userpool/eu-north-1_KHLJifQDi",
        ]
      + rest_api_id                      = "4iujmd0o21"
      + type                             = "COGNITO_USER_POOLS"
    }

  # aws_lambda_function.getproducts_lambda will be updated in-place
  ~ resource "aws_lambda_function" "getproducts_lambda" {
        id                             = "GetProducts"
      ~ last_modified                  = "2022-11-19T20:13:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "8M2PF0rPmT18cYx3B/++sdlXcG9ffxh5Bl/jq4dcs2E=" -> "1miQx+qAiF/D0ZcS20GP52Lmvzdv/qjt8k8dtMqFPoE="
        tags                           = {}
        # (19 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.fridge_mate will be updated in-place
  ~ resource "aws_s3_bucket" "fridge_mate" {
        id                          = "fridge-mate"
        tags                        = {}
        # (14 unchanged attributes hidden)


      - website {
          - error_document = "error.html" -> null
          - index_document = "index.html" -> null
        }
        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_cors_configuration.cors_config will be created
  + resource "aws_s3_bucket_cors_configuration" "cors_config" {
      + bucket = "fridge-mate"
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "Authorization",
              + "Content-Length",
            ]
          + allowed_methods = [
              + "GET",
              + "POST",
            ]
          + allowed_origins = [
              + "https://fridgemate.teashaped.dev",
            ]
          + expose_headers  = []
          + max_age_seconds = 3000
        }
    }

  # aws_s3_bucket_object.getproducts_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "getproducts_object" {
      ~ etag               = "c87e983399885d062bd0a7020d50644e" -> "2ee2650cd7920dd999a4eb7033a45bac"
        id                 = "getproducts.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.


```

</details>

*Pushed by: @kejne, Action: `pull_request`*